import 'package:latlong2/latlong.dart';

class MapMarker {
  final String? title;
  final String? description;
  final LatLng? location;
  final List<LatLng> shape;

  MapMarker({
    required this.title,
    required this.description,
    required this.location,
    required this.shape,
  });
}

final mapMarkers = [
  MapMarker(
      title: 'Главный корпус',
      description: 'Главный учебный корпус',
      location: LatLng(54.764367, 32.030974),
      shape: [
      LatLng(54.763750, 32.029837), 
      LatLng(54.763875, 32.029670), 
      LatLng(54.764690, 32.031460), 
      LatLng(54.764822, 32.031281),
      LatLng(54.765098, 32.031894),
      LatLng(54.764841, 32.032247),
      LatLng(54.763750, 32.029837), 
    ],
      ),
  MapMarker(
      title: 'Крыло "А"',
      description: 'Старый учебный корпус. Проход в Старый корпус осуществляется через переход из Главного корпуса по 2-му этажу.',
      location: LatLng(54.764088, 32.031430),
      shape: [
      LatLng(54.763712, 32.031395), 
      LatLng(54.763964, 32.031055), 
      LatLng(54.764273, 32.031741),
      LatLng(54.764172, 32.031876),
      LatLng(54.763938, 32.031357),
      LatLng(54.763787, 32.031561),
      LatLng(54.763712, 32.031395), 
    ],
      ),
  MapMarker(
      title: 'Крыло "Б"',
      description: 'Старый учебный корпус. Проход в Старый корпус осуществляется через переход из Главного корпуса по 2-му этажу.',
      location: LatLng(54.763935, 32.032362),
      shape: [
      LatLng(54.764273, 32.031741),
      LatLng(54.764330, 32.031869), 
      LatLng(54.763968, 32.032358),
      LatLng(54.764193, 32.032859), 
      LatLng(54.764081, 32.033011), 
      LatLng(54.763856, 32.032511),
      LatLng(54.763502, 32.032990), 
      LatLng(54.763444, 32.032860), 
      LatLng(54.764273, 32.031741), 
    ],
      ),
  MapMarker(
      title: 'Крыло "В"',
      description: 'Старый учебный корпус. Проход в Старый корпус осуществляется через переход из Главного корпуса по 2-му этажу.',
      location: LatLng(54.763353, 32.032447),
      shape: [
      LatLng(54.763444, 32.032860), 
      LatLng(54.763136, 32.032178), 
      LatLng(54.763388, 32.031840),
      LatLng(54.763466, 32.032015),
      LatLng(54.763310, 32.032225),
      LatLng(54.763539, 32.032732),
      LatLng(54.763444, 32.032860),
    ],
      ),
  MapMarker(
      title: 'Крыло "Г"',
      description: 'Старый учебный корпус. Проход в Старый корпус осуществляется через переход из Главного корпуса по 2-му этажу.',
      location: LatLng(54.764403, 32.032167),
      shape: [
      LatLng(54.764210, 32.032033),
      LatLng(54.764330, 32.031869), 
      LatLng(54.764558, 32.032375),
      LatLng(54.764438, 32.032538),
      LatLng(54.764210, 32.032033), 
    ],
      ),
   MapMarker(
      title: 'Крыло "Д"',
      description: 'Старый учебный корпус. Проход в Старый корпус осуществляется через переход из Главного корпуса по 2-му этажу.',
      location: LatLng(54.763693, 32.033198),
      shape: [
      LatLng(54.763617, 32.032833), 
      LatLng(54.763710, 32.033043), 
      LatLng(54.763704, 32.033051),
      LatLng(54.763839, 32.033353),
      LatLng(54.763702, 32.033539),
      LatLng(54.763570, 32.033244),
      LatLng(54.763598, 32.033205),
      LatLng(54.763502, 32.032990),
      LatLng(54.763617, 32.032833), 
    ],
      ),
  MapMarker(
      title: 'Лекционный корпус',
      description: 'Лекционный корпус института. Проход в Лекционный корпус осуществляется через переход из Главного корпуса по 1-му или 2-му этажу.',
      location: LatLng(54.763635, 32.030482),
      shape: [
      LatLng(54.763632, 32.030043), 
      LatLng(54.763871, 32.030589), 
      LatLng(54.763629, 32.030920),
      LatLng(54.763382, 32.030384),
      LatLng(54.763632, 32.030043), 
    ],
      ),
  MapMarker(
      title: 'Стадион',
      description: 'Стадион СФ МЭИ',
      location: LatLng(54.762223, 32.031772),
      shape: [],
      ),
  MapMarker(
      title: 'Спортивная площадка',
      description: 'Спортплощадка СФ МЭИ',
      location: LatLng(54.763278, 32.031124),
      shape: [],  
      ),
         
];
